Analysing the data of teachers in KSA

In [34]:
import numpy as np 
import pandas as pd 
import seaborn as sns

In [14]:
#Reading the data
df=pd.read_csv("Salary by Education.csv")

In [15]:
df.head()

  Degree Level Nationality  Gender Year Quarter  Salary Currency
0      Primary    NonSaudi  Female      2017 Q1    1590      SAR
1      Primary    NonSaudi    Male      2017 Q1    2173      SAR
2      Primary       Saudi  Female      2017 Q1    4172      SAR
3      Primary       Saudi    Male      2017 Q1    6172      SAR
4      Primary    NonSaudi  Female      2017 Q2    1597      SAR

In [16]:
# shape of data
df.shape

(504, 6)

In [17]:
df.columns.to_list()

['Degree Level', 'Nationality', 'Gender', 'Year Quarter', 'Salary', 'Currency']

In [18]:
# making names of columns of LOWERCASE
df= df.rename(columns=str.lower)
df.head()

  degree level nationality  gender year quarter  salary currency
0      Primary    NonSaudi  Female      2017 Q1    1590      SAR
1      Primary    NonSaudi    Male      2017 Q1    2173      SAR
2      Primary       Saudi  Female      2017 Q1    4172      SAR
3      Primary       Saudi    Male      2017 Q1    6172      SAR
4      Primary    NonSaudi  Female      2017 Q2    1597      SAR

dividing year quarter into 'year'& 'quarter'

In [19]:
df[['year', 'quarter']] = df['year quarter'].str.split(' ', 1, expand=True)

In [20]:
df.head()

  degree level nationality  gender year quarter  salary currency  year quarter
0      Primary    NonSaudi  Female      2017 Q1    1590      SAR  2017      Q1
1      Primary    NonSaudi    Male      2017 Q1    2173      SAR  2017      Q1
2      Primary       Saudi  Female      2017 Q1    4172      SAR  2017      Q1
3      Primary       Saudi    Male      2017 Q1    6172      SAR  2017      Q1
4      Primary    NonSaudi  Female      2017 Q2    1597      SAR  2017      Q2

In [22]:
# drop year quarter column
df.drop(['year quarter'], axis=1, inplace=True)
df.head(4)

  degree level nationality  gender  salary currency  year quarter
0      Primary    NonSaudi  Female    1590      SAR  2017      Q1
1      Primary    NonSaudi    Male    2173      SAR  2017      Q1
2      Primary       Saudi  Female    4172      SAR  2017      Q1
3      Primary       Saudi    Male    6172      SAR  2017      Q1

In [23]:
df.shape

(504, 7)

In [26]:
df.describe()

             salary
count    504.000000
mean    8950.031746
std     6372.635277
min     1331.000000
25%     4194.000000
50%     7890.500000
75%    12448.750000
max    35622.000000

In [35]:
import matplotlib.pyplot as plt

In [53]:
# the nationality of the highest salary
dff=df[df["salary"]==df["salary"].max()]
dff.nationality

427    Saudi
Name: nationality, dtype: object

In [57]:
# the mean average of salaries according to degree level
dfe=df.groupby("degree level")["salary"].mean()

In [59]:
dfe

degree level
Bachelor          9535.555556
Diploma           7036.694444
Doctorate        19835.458333
Intermediate      4101.527778
Master Degree    13797.875000
Primary           3569.041667
Secondary         4774.069444
Name: salary, dtype: float64

In [64]:
# how the salaries changed over last 5 years
df.groupby(["degree level","year"])["salary"].mean()

degree level   year
Bachelor       2017     9402.5000
               2018     9634.0000
               2019     9864.5000
               2020     9325.6250
               2021     9366.7500
Diploma        2017     6791.3125
               2018     7092.1250
               2019     7405.3750
               2020     7007.0625
               2021     6738.5000
Doctorate      2017    18590.1875
               2018    18918.0000
               2019    19599.0625
               2020    20205.8750
               2021    23892.8750
Intermediate   2017     3934.2500
               2018     4207.0625
               2019     4194.6250
               2020     4163.6250
               2021     3914.6250
Master Degree  2017    13321.0625
               2018    13388.0625
               2019    14076.8125
               2020    13586.3125
               2021    15436.3750
Primary        2017     3487.3750
               2018     3554.1875
               2019     3734.5000
               2020     3649.2500
               2021     3270.7500
Secondary      2017     4800.3750
               2018     4815.6875
               2019     4923.3750
               2020     4744.1250
               2021     4399.5000
Name: salary, dtype: float64

In [66]:
# the difference between salaries of males and females
df.groupby(["gender","degree level"]).mean()

                            salary
gender degree level
Female Bachelor        8417.750000
       Diploma         6694.055556
       Doctorate      17172.750000
       Intermediate    3161.000000
       Master Degree  11605.166667
       Primary         2929.444444
       Secondary       3671.750000
Male   Bachelor       10653.361111
       Diploma         7379.333333
       Doctorate      22498.166667
       Intermediate    5042.055556
       Master Degree  15990.583333
       Primary         4208.638889
       Secondary       5876.388889

In [68]:
# is there a difference in salaries between saudi and nonsaudi ?
df.groupby("nationality")["salary"].mean()

nationality
NonSaudi     6663.587302
Saudi       11236.476190
Name: salary, dtype: float64

In [69]:
# had the salaries been chsnged during QUARETRS?
df.groupby(["year","quarter"]).mean()

                   salary
year quarter
2017 Q1       8777.821429
     Q2       8644.857143
     Q3       8622.250000
     Q4       8427.678571
2018 Q1       8551.678571
     Q2       9013.642857
     Q3       9062.928571
     Q4       8576.964286
2019 Q1       8865.107143
     Q2       9189.892857
     Q3       9106.571429
     Q4       9294.571429
2020 Q1       9443.642857
     Q2       8662.214286
     Q3       8609.214286
     Q4       9103.142857
2021 Q1       9550.607143
     Q2       9597.785714